ERP DEV.WMS/src/Documents/вмс_ВыборочнаяИнвентаризация/вмс_ВыборочнаяИнвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ВыборочнаяИнвентаризация</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТаблицуПустымиЯчейками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/вмс_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_МестаХранения</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЯчейки</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЯчеекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаНомер</name>
    <comment>Сквозная в длину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаРяд</name>
    <comment>Сквозная в ширину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЭтаж</name>
    <comment>Нумерация в высоту (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаБезразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТехническое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСверху</name>
    <comment>ТУ_Августинович 000056225 28.10.2025. Для интерактивной карты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияРяд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСтеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияЯрус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияМесто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Documents/вмс_ВыборочнаяИнвентаризация/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ПеременныеКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект,Неопределено);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПеременныеКлиент = Новый Структура;
	ПеременныеКлиент.Вставить("ТоварныеПоляМассив", ПолучитьТоварныеПоля());
	ПеременныеКлиент.Вставить("ИспользуемыеПоляМассив", ПолучитьИспользуемыеПоля(ПеременныеКлиент.ТоварныеПоляМассив));
	ПеременныеКлиент.Вставить("КомандаЗаполнения", "");
	
	ВосстановитьНастройкиФормы();
	
	ОбновитьОтображениеПолейТаблицы(ПеременныеКлиент.ИспользуемыеПоляМассив);
	ЗадатьСписокВыбора();
	ПрочиеПроверкиПередЗапуском();
	
	ПеременныеКлиент.Вставить("СтатусДокумента", Элементы.Статус.ТекстРедактирования);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СохранитьНастройкиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// ТУ_Самойленко 19.04.23 ++
	Если ЗначениеЗаполнено(ПеременныеКлиент.КомандаЗаполнения) Тогда
		Если ПеременныеКлиент.КомандаЗаполнения = "ЗаполнитьИсполнителейВыделенныхСтрок" Тогда
			ЗаполнитьСтрокиИсполнителем(ВыбранноеЗначение);
		ИначеЕсли ПеременныеКлиент.КомандаЗаполнения = "РаспределитьИсполнителей" Тогда
			РаспределитьПланПоИсполнителям(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	ПеременныеКлиент.КомандаЗаполнения = "";
	// ТУ_Самойленко 19.04.23 --
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтрокиИсполнителем(НовыйИсполнитель)
	
	Для каждого Индекс Из Элементы.ПланВыборочнойИнвентаризации.ВыделенныеСтроки Цикл
		
		ИзменяемаяСтрока = Объект.Товары.НайтиПоИдентификатору(Индекс);
		ИзменяемаяСтрока.Исполнитель = НовыйИсполнитель;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция РаспределитьПланПоИсполнителям(Исполнители)
	
	ТаблицаПлан = Объект.Товары;
	ЯчейкиТЗ = ТаблицаПлан.Выгрузить(, "Ячейка");
	ЯчейкиТЗ.Свернуть("Ячейка");
	мЯчейки = ЯчейкиТЗ.ВыгрузитьКолонку("Ячейка");
	
	ЧислоИсполнителей = Исполнители.Количество();
	ЧислоСтрок = ТаблицаПлан.Количество(); 
	
	Если ЧислоИсполнителей < 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Отказ по причине - Не указан ни один исполнитель!");
		Возврат Ложь;	
	КонецЕсли;
	Если ЧислоСтрок < 1 Или ЧислоСтрок < ЧислоИсполнителей Тогда
		ОбщегоНазначения.СообщитьПользователю("Отказ по причине - Недостаточно строк в табличной части для распределения!");
		Возврат Ложь;	
	КонецЕсли;
	
	СтрокНаИсполнителя = Цел(ЧислоСтрок/ЧислоИсполнителей);
	ПоследнийИсполнитель = Исполнители[ЧислоИсполнителей - 1];
	ТекущийИндекс = 0;
	ТекущийИсполнитель = Исполнители[ТекущийИндекс];
	ОсталосьРаспределитьСтрок = СтрокНаИсполнителя; 
	
	Если мЯчейки.Количество() < ЧислоИсполнителей Тогда 
		ОбщегоНазначения.СообщитьПользователю("Отказ по причине - Количество исполнителей превышает количество ячеек!");
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Ячейка Из мЯчейки Цикл
		НайденныеСтроки = ТаблицаПлан.НайтиСтроки(Новый Структура("Ячейка", Ячейка));
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.Исполнитель = ТекущийИсполнитель;	
		КонецЦикла;
		ОсталосьРаспределитьСтрок = ОсталосьРаспределитьСтрок - НайденныеСтроки.Количество();
		Если ОсталосьРаспределитьСтрок < 1 И ТекущийИсполнитель <> ПоследнийИсполнитель Тогда
			ТекущийИндекс = ТекущийИндекс + 1;
			ТекущийИсполнитель = Исполнители[ТекущийИндекс];
			ОсталосьРаспределитьСтрок = СтрокНаИсполнителя;		
		КонецЕсли;		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ОбновитьОтображениеПолейТаблицы(ИспользуемыеПоляМассив)
	
	Для каждого ИмяПоля Из ИспользуемыеПоляМассив Цикл
		Элементы["ПланВыборочнойИнвентаризации" + ИмяПоля].Видимость = Истина;	
	КонецЦикла;
	
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	ОтборПриИзмененииНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Функция ОтборПриИзмененииНаСервере(ИмяПоля)
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого Поле Из ЭтотОбъект[ИмяПоля] Цикл
		Если Не ЗначениеЗаполнено(Поле.Значение) Тогда
			УдаляемыеЭлементы.Добавить(Поле);		
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		ЭтотОбъект[ИмяПоля].Удалить(УдаляемыйЭлемент);	
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Элемент.ВыделенныйТекст = "В работе" Тогда
		Результат = ПроверитьАктуальностьТабличныхДанных();
		Если ЗначениеЗаполнено(Результат) Тогда			
			ОО = Новый ОписаниеОповещения("ОбработкаАктуализацииДанных", ЭтотОбъект, Результат);
			ПоказатьВопрос(ОО, "Обнаружено расхождение плана инвентаризации с учтенными остатками! Актуализировать данные?", РежимДиалогаВопрос.ДаНетОтмена, 0,,"Обнаружено расхождение!");	
		Иначе
			ОбработкаАктуализацииДанных();
		КонецЕсли;
	Иначе
		ОбработкаАктуализацииДанных();	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииСервер()
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Исполнитель", Справочники.ФизическиеЛица.ПустаяСсылка()));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Объект.Статус = Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Подготовка", "Выборочная инвентаризация");
		ОбщегоНазначения.СообщитьПользователю("Невозможно изменить статус документа пока план инвентаризации полностью не распределен между исполнителями!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЧтоДелатьПослеВыбора = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Фильтр = "Excel-файл (*.xls;*.xlsx)|*.xls;*.xlsx";
	Проводник.Фильтр = Фильтр;
	Проводник.Показать(ЧтоДелатьПослеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицуВыборочнойИнвентаризации(Команда)
	
	ЗаполнитьПланВыборочнойИнвентаризации(ПеременныеКлиент.ТоварныеПоляМассив);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПланВыборочнойИнвентаризации(ТоварныеПоляМассив)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ячейка
	|ПОМЕСТИТЬ МестаХранения
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Владелец = &Склад
	|	И вмс_МестаХранения.ПометкаУдаления = ЛОЖЬ
	|	И вмс_МестаХранения.ЭтоГруппа = ЛОЖЬ
	|	И &УсловиеТипЯчейки
	|	И &УсловиеПомещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестаХранения.Ячейка КАК Ячейка,
	|	Остатки.Контейнер КАК Контейнер,
	|	Остатки.Товар КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Партия КАК Партия,
	|	Остатки.Серия КАК Серия,
	|	Остатки.Качество КАК Качество,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	МестаХранения КАК МестаХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|				,
	|				Ячейка.Владелец = &Склад
	|					И &УсловиеПоТоварам) КАК Остатки
	|		ПО МестаХранения.Ячейка = Остатки.Ячейка
	|ГДЕ
	|	&ЗаполнятьПустымиЯчейками";
	
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Если ЗначениеЗаполнено(Объект.Помещение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПомещение", "вмс_МестаХранения.Помещение В(&УсловиеПомещение)");
		Запрос.УстановитьПараметр("УсловиеПомещение", Объект.Помещение);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПомещение", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыЯчеекДляИнвентаризации) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТипЯчейки", "вмс_МестаХранения.ТипЯчейки В(&УсловиеТипЯчейки)");
		Запрос.УстановитьПараметр("УсловиеТипЯчейки", ТипыЯчеекДляИнвентаризации);
	Иначе
		Запрос.УстановитьПараметр("УсловиеТипЯчейки", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТоварыДляИнвентаризации) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТоварам", "Номенклатура В(&УсловиеПоТоварам)");
		Запрос.УстановитьПараметр("УсловиеПоТоварам", ТоварыДляИнвентаризации);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоТоварам", Истина);
	КонецЕсли;
	
	Если Объект.ЗаполнятьТаблицуПустымиЯчейками Тогда
		Запрос.УстановитьПараметр("ЗаполнятьПустымиЯчейками", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗаполнятьПустымиЯчейками", "НЕ Остатки.КоличествоОстаток ЕСТЬ NULL");
	КонецЕсли;
	
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого Строка Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Строка.Артикул = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "Артикул");
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуЯчейкамиБезНаполнения()
	
	ДоступныеЯчейки = ПолучитьЯчейкиПоОтбору();
	ВнесенныеЯчейки = ПолучитьЯчейкиТаблицы();
	вмс_РаботаСКоллекциями.ВычестьМассив(ДоступныеЯчейки, ВнесенныеЯчейки);
	
	Для Каждого Ячейка Из ДоступныеЯчейки Цикл
		Если Не Ячейка.ЭтоГруппа Тогда
			СтрокаТаблицы = Объект.Товары.Добавить();
			СтрокаТаблицы.Ячейка = Ячейка; 
		КонецЕсли;
	КонецЦикла;
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьИсполнителейВыделенныхСтрок(Команда)
		
	ПеременныеКлиент.КомандаЗаполнения = "ЗаполнитьИсполнителейВыделенныхСтрок";
	
	// ТУ_Герасимов 29.10.2025 ++
	
	СписокСотрудников = ПолучитьСписокСотрудников();
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	
	Отбор = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ПравоеЗначение = СписокСотрудников;
	Отбор.Использование = Истина;    
	// ТУ_Герасимов 29.10.2025 --
	
	
	ПараметрыИсполнения = Новый Структура;
	ПараметрыИсполнения.Вставить("РежимВыбора", Истина);
	ПараметрыИсполнения.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);	

	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыИсполнения, ЭтаФорма);
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьСписокСотрудников()
 	 Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|ФизическиеЛица.Наименование КАК Наименование
	|ИЗ
	|Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|	ПО (вмс_НастройкиОператора.Оператор = ФизическиеЛица.Ссылка)
	|ГДЕ
	|вмс_НастройкиОператора.Оператор.Ссылка = ФизическиеЛица.Ссылка";
	
	СписокСотрудников = Новый СписокЗначений;
	СписокСотрудников.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Возврат СписокСотрудников;
КонецФункции

&НаКлиенте
Процедура РаспределитьИсполнителей(Команда)
	ПеременныеКлиент.КомандаЗаполнения = "РаспределитьИсполнителей";   
	
	ПараметрыИсполнения = Новый Структура("РежимВыбора, МножественныйВыбор", Истина, Истина);	
	// ТУ_Герасимов 29.10.2025 ++
	СписокСотрудников = ПолучитьСписокСотрудников();
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	
	Отбор = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ПравоеЗначение = СписокСотрудников;
	Отбор.Использование = Истина;    
	
	ПараметрыИсполнения.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	
	// ТУ_Герасимов 29.10.2025 --
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыИсполнения, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоИнвентаризации(Команда)
	
	ФормаОтчета = ПолучитьФорму("Отчет.вмс_РезультатыВыборочнойИнвентаризации.ФормаОбъекта");
	
	КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Распоряжение"); 
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	ПользовательскийПараметр = ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	ПользовательскийПараметр.Использование = Истина;
	ПользовательскийПараметр.Значение = Объект.Ссылка;
	
	ФормаОтчета.Открыть();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗадатьСписокВыбора()
	
	СписокВыбора = Новый Массив;
	// ТУ_Самойленко 18.05.23 ++
	СписокВыбора.Добавить(Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Подготовка", "Выборочная инвентаризация"));
	СписокВыбора.Добавить(Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("В работе", "Выборочная инвентаризация"));
	СписокВыбора.Добавить(Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Ожидает подтверждения", "Выборочная инвентаризация"));
	СписокВыбора.Добавить(Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Исполнен", "Выборочная инвентаризация"));
	// ТУ_Самойленко 18.05.23 --
	Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
КонецФункции

&НаСервере
Функция ПрочиеПроверкиПередЗапуском()
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		// ТУ_Самойленко 18.05.23 ++
		Объект.Статус = Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Подготовка", "Выборочная инвентаризация");
		// ТУ_Самойленко 18.05.23 --
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьЯчейкиПоОтбору()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Владелец = &Склад";
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ячейки) Тогда
		
		Запрос.Текст = Запрос.Текст + " И" + ?(ЭтотОбъект.ИсключаяЯчейки, " НЕ ", " ") + "вмс_МестаХранения.Ссылка В (&Ячейки)";
		Запрос.УстановитьПараметр("Ячейки", ЭтотОбъект.Ячейки); 
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Функция ПолучитьЯчейкиТаблицы()
	
	МассивЯчеек = Новый Массив;
	
	Для Каждого Строка Из Объект.Товары Цикл
		Если МассивЯчеек.Найти(Строка.Ячейка) = Неопределено Тогда
			МассивЯчеек.Добавить(Строка.Ячейка);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЯчеек;	
	
КонецФункции

&НаСервере
Функция ПолучитьТоварныеПоля()
	
	ИспользуемыеТоварныеПоля = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	вмс_РаботаСКоллекциями.ВычестьМассив(ИспользуемыеТоварныеПоля, "Упаковка");
	Возврат ИспользуемыеТоварныеПоля;
	
КонецФункции

&НаСервере
Функция ПолучитьИспользуемыеПоля(ТоварныеПоляМассив)
	
	ПредопределенныеПоля = Новый Массив;
	//ПредопределенныеПоля.Добавить("Склад"); 
	ПредопределенныеПоля.Добавить("Ячейка");
	ПредопределенныеПоля.Добавить("Контейнер");
	ПредопределенныеПоля.Добавить("КоличествоПлан");
	ПредопределенныеПоля.Добавить("КоличествоФакт");
	
	Возврат вмс_РаботаСКоллекциями.СложениеМассивов(ПредопределенныеПоля, ТоварныеПоляМассив);	
	
КонецФункции 

&НаСервере
Функция ПолучитьСтруктуруЗагрузки()
	
	СтруктураСейва = Новый Структура;	
	СтруктураСейва.Вставить("ТипыЯчеекДляИнвентаризации", ТипыЯчеекДляИнвентаризации.ВыгрузитьЗначения());
	СтруктураСейва.Вставить("ТоварыДляИнвентаризации", ТоварыДляИнвентаризации.ВыгрузитьЗначения());
	
	Возврат СтруктураСейва;
	
КонецФункции 

&НаСервере
Функция СохранитьНастройкиФормы()
	
	СохраняемыеДанные = ПолучитьСтруктуруЗагрузки();	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("вмс_ПлановаяИнвентаризация", "НастройкиФормы", СохраняемыеДанные,,);
	
КонецФункции

&НаСервере
Функция ВосстановитьНастройкиФормы()
	
	СохраняемыеДанные = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("вмс_ПлановаяИнвентаризация", "НастройкиФормы");
	Если ЗначениеЗаполнено(СохраняемыеДанные) Тогда
		ЗаполнитьДанныеФормыПоСтруктуре(СохраняемыеДанные);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеФормыПоСтруктуре(СтруктураСейва)
	
	Попытка
		Для Каждого Поле Из СтруктураСейва Цикл
			Если ТипЗнч(ЭтотОбъект[Поле.Ключ]) = Тип("СписокЗначений") Тогда
				ЭтотОбъект[Поле.Ключ].ЗагрузитьЗначения(Поле.Значение);	
			Иначе
				ЭтотОбъект[Поле.Ключ] = Поле.Значение;
			КонецЕсли;
		КонецЦикла;	
	Исключение
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоУчетнойСистемы(ДанныеТовара, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", ДанныеТовара.Товар);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Характеристика", ДанныеТовара.Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();;
		Выборка.Следующий();
		Возврат Выборка.Количество;
	КонецЕсли;
	
КонецФункции

// ТУ_Самойленко 05.07.23 ++ [Блокировка ячеек]
&НаКлиенте
Процедура ОбработкаАктуализацииДанных(Ответ=Неопределено, Результат=Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Если Ответ <> Неопределено И Результат <> Неопределено Тогда
		Отказ = ?(Ответ = КодВозвратаДиалога.Да ИЛИ Ответ = КодВозвратаДиалога.Отмена, Истина, Ложь);
		ПостобработкаАктуализацииДанных(?(Ответ = КодВозвратаДиалога.Да, Истина, Ложь), Результат);
	КонецЕсли; 
	
	// ТУ_Самойленко 05.07.23 ++ [Блокировка ячеек] 
	ПараметрыОбработчика = Новый Структура("Отказ, ОтказБлокировки, Ответ", Отказ, Ложь, Неопределено);
	Если Элементы.Статус.ТекстРедактирования = "В работе" И Ответ <> КодВозвратаДиалога.Отмена Тогда
		СписокЯчеек = ПолучитьСписокЯчеекТабличнойЧасти();
		Ответ = ВедетсяРаботаСЯчейками(СписокЯчеек);  	
		ОтказБлокировки = Ответ.ВедетсяРаботаСЯчейками ИЛИ Ответ.ПроводитсяИнвентаризацияЯчеек;
		Если ОтказБлокировки Тогда
			ПараметрыОбработчика.ОтказБлокировки = ОтказБлокировки;
			ПараметрыОбработчика.Ответ = Ответ;
			ОбщегоНазначенияКлиент.СообщитьПользователю(Ответ.ТекстСообщения);
			ОО = Новый ОписаниеОповещения("ЗавершениеОбработкаАктуализацииДанных", ЭтаФорма, ПараметрыОбработчика);
			ПоказатьВопрос(ОО, "Одна или несколько ячеек недоступны для изменения вида блокировки. Очистить таблицу от данных ячеек и продолжить?", РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Иначе
			ЗавершениеОбработкаАктуализацииДанных(Неопределено, ПараметрыОбработчика);
		КонецЕсли;
	Иначе
		ЗавершениеОбработкаАктуализацииДанных(Неопределено, ПараметрыОбработчика);	
	КонецЕсли; 
	// ТУ_Самойленко 05.07.23 -- [Блокировка ячеек]
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбработкаАктуализацииДанных(Результат, ПараметрыОбработчика) Экспорт
	
	Если Результат = Неопределено Тогда 
		
		Если ПараметрыОбработчика.Отказ Тогда
			ВернутьПрежнийСтатус(ПеременныеКлиент.СтатусДокумента);
		Иначе
			СтатусПриИзмененииСервер();
		КонецЕсли;
		ПеременныеКлиент.СтатусДокумента = Элементы.Статус.ТекстРедактирования;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда   
		
		ВернутьПрежнийСтатус(ПеременныеКлиент.СтатусДокумента);	
		ПеременныеКлиент.СтатусДокумента = Элементы.Статус.ТекстРедактирования;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		УдалитьСтрокиСЯчейками(ПараметрыОбработчика.Ответ.НедоступныеЯчейки);
		СтатусПриИзмененииСервер();
		ПеременныеКлиент.СтатусДокумента = Элементы.Статус.ТекстРедактирования;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьСтрокиСЯчейками(СписокЯчеек) 
	
	ТаблицаТоваров = Объект.Товары.Выгрузить();
	Для Каждого Ячейка Из СписокЯчеек Цикл
		НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(Новый Структура("Ячейка", Ячейка));
		Для Каждого Строка Из НайденныеСтроки Цикл
			ТаблицаТоваров.Удалить(Строка);	
		КонецЦикла;
	КонецЦикла; 
	Объект.Товары.Загрузить(ТаблицаТоваров);
	
КонецФункции

&НаСервере
Функция ВедетсяРаботаСЯчейками(СписокЯчеек) 
	Возврат РегистрыСведений.вмс_ПроверяемыеСлужебныеЗоны.ВедетсяРаботаСЯчейками(СписокЯчеек, Объект.Ссылка);	
КонецФункции

&НаСервере
Функция ПолучитьСписокЯчеекТабличнойЧасти()
	
	ТаблицаЯчеек = Объект.Товары.Выгрузить(,"Ячейка");
	ТаблицаЯчеек.Свернуть("Ячейка");
	Возврат ТаблицаЯчеек.ВыгрузитьКолонку("Ячейка");
	
КонецФункции
// ТУ_Самойленко 05.07.23 -- [Блокировка ячеек]

&НаСервере
Функция ПолучитьРедактируемыеТипы()
	
	РедактируемыеТипы = Новый Массив;
	РедактируемыеТипы.Добавить(Тип("ПолеФормы"));
	РедактируемыеТипы.Добавить(Тип("ТаблицаФормы"));
	
	Возврат РедактируемыеТипы;
	
КонецФункции

&НаСервере
Функция ЗаполнитьКоличествоФакт(ИтоговаяОперация)
	
	//ПоляОтбора = вмс_РаботаСКоллекциями.СтрокуВМассив("Ячейка, Контейнер, Товар, Характеристика, Часть, Серия, Качество");
	ПоляОтбора = ПолучитьТоварныеПоля();
	ПоляОтбора.Добавить("Ячейка");
	ПоляОтбора.Добавить("Контейнер");
	
	КонвертацияИмен = Новый Структура;
	КонвертацияИмен.Вставить("Контейнер", "Контейнер");
	
	Для Каждого Строка Из ИтоговаяОперация.ТоварыПоИнвентаризации Цикл
		
		Отбор = Новый Структура;
		Для Каждого ИмяПоля Из ПоляОтбора Цикл
			нИмяПоля = ?(КонвертацияИмен.Свойство(ИмяПоля), КонвертацияИмен[ИмяПоля], ИмяПоля);
			Отбор.Вставить(нИмяПоля, Строка[ИмяПоля]);
		КонецЦикла;
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			НайденныеСтроки[0].КоличествоФакт = Строка.Количество;	
		Иначе
			ДобавочнаяСтрока = Объект.Товары.Добавить();
			Для Каждого ИмяПоля Из ПоляОтбора Цикл
				нИмяПоля = ?(КонвертацияИмен.Свойство(ИмяПоля), КонвертацияИмен[ИмяПоля], ИмяПоля);
				ДобавочнаяСтрока[нИмяПоля] = Строка[ИмяПоля];
				ДобавочнаяСтрока.КоличествоФакт = Строка.Количество;
				ДобавочнаяСтрока.Количество = Строка.КоличествоУчет;
				ДобавочнаяСтрока.Исполнитель = НайтиИсполнителяСтроки(Строка, ПоляОтбора);
			КонецЦикла; 
			ДобавочнаяСтрока.Артикул = ДобавочнаяСтрока.Товар.Артикул;
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.Товары.Сортировать("Ячейка, Контейнер, Артикул, Товар");
	
	// ТУ_Самойленко 24.05.23 ++
	Объект.Товары.Загрузить(УдалитьПустыеСтрокиЗаполненныхЯчеек(Объект.Товары.Выгрузить()));
	// ТУ_Самойленко 24.05.23 --
	
	Модифицированность = Истина;
	
КонецФункции

&НаСервере
Функция НайтиИсполнителяСтроки(Строка, ПоляОтбора)
	
	ТоварныеПоля = ПолучитьТоварныеПоля();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка.Ответственный КАК Исполнитель
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам.ТоварыПоИнвентаризации КАК вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Контейнер = &Контейнер";
	Для Каждого ИмяПоля Из ТоварныеПоля Цикл
		Запрос.Текст = Запрос.Текст + "	И вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации." + ИмяПоля + " = &" + ИмяПоля;	
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + "
	|	И вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ячейка = &Ячейка
	|	И вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка.Проведен = ИСТИНА
	|	И вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка.ДокументОснование = &Документ
	|	И НЕ вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка.Комментарий ПОДОБНО ""##Подведение итогов""";
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	Для Каждого ИмяПоля Из ПоляОтбора Цикл
		Запрос.УстановитьПараметр(ИмяПоля, Строка[ИмяПоля]);
	КонецЦикла;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Выборка.Следующий();
		Исполнитель = Выборка.Исполнитель; 
	Иначе
		Исполнитель = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Исполнитель;
	
КонецФункции

&НаСервере
Функция ПроверитьАктуальностьТабличныхДанных()
	
	Идентичны = Истина;
	
	ПоляОтбора = вмс_РаботаСКоллекциями.СтрокуВМассив("Ячейка, Контейнер, Номенклатура, Характеристика, Партия, Серия, Качество, Количество");
	
	ТаблицаИсточник = Объект.Товары.Выгрузить();
	
	ЗаполнитьПланВыборочнойИнвентаризации(ПолучитьТоварныеПоля());
	
	Если Объект.ЗаполнятьТаблицуПустымиЯчейками Тогда
		ЗаполнитьТаблицуЯчейкамиБезНаполнения();	
	КонецЕсли; 
	
	Если ТаблицаИсточник.Количество() = Объект.Товары.Количество() Тогда
		Для Каждого Строка Из ТаблицаИсточник Цикл
			
			Отбор = Новый Структура;
			Для Каждого ИмяПоля Из ПоляОтбора Цикл
				Отбор.Вставить(ИмяПоля, Строка[ИмяПоля]);		
			КонецЦикла;
			
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() <> 1 Тогда
				Идентичны = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Идентичны = Ложь;
	КонецЕсли;
	
	Если Идентичны Тогда 
		Объект.Товары.Очистить();
		Объект.Товары.Загрузить(ТаблицаИсточник);
		Возврат Неопределено;	
	Иначе
		Возврат вмс_РаботаСКоллекциями.ЗагрузитьКвазиТаблицуЗначенийИзТаблицыЗначений(ТаблицаИсточник);	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПостобработкаАктуализацииДанных(Актуализировать, КвазиТаблицаИсточник) 
	
	ТаблицаИсточник = вмс_РаботаСКоллекциями.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(КвазиТаблицаИсточник);
	
	Если Актуализировать Тогда
		ПоляОтбора = вмс_РаботаСКоллекциями.СтрокуВМассив("Ячейка, Контейнер, Товар, Характеристика, Партия, Серия, Качество");
		Для Каждого Строка Из ТаблицаИсточник Цикл
			Отбор = Новый Структура;
			Для Каждого ИмяПоля Из ПоляОтбора Цикл
				Отбор.Вставить(ИмяПоля, Строка[ИмяПоля]);		
			КонецЦикла;
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				Для Каждого нСтрока Из НайденныеСтроки Цикл
					нСтрока.Исполнитель = Строка.Исполнитель;	
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Объект.Товары.Очистить();
		Объект.Товары.Загрузить(ТаблицаИсточник);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ВернутьПрежнийСтатус(СтатусДокумента)
	
	Объект.Статус = Справочники.вмс_СтатусыДокументов.ПолучитьСтатус(СтатусДокумента, "Выборочная инвентаризация");	
	
КонецПроцедуры

&НаСервере
Функция УдалитьПустыеСтрокиЗаполненныхЯчеек(Таблица)
	
	ПустыеЯчейки = Новый Массив;
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого Строка Из Таблица Цикл		
		Если Не ЗначениеЗаполнено(Строка.Товар) Тогда
			Если ПустыеЯчейки.Найти(Строка.Ячейка) = Неопределено Тогда
				ПустыеЯчейки.Добавить(Строка.Ячейка);	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого ПустаяЯчейка Из ПустыеЯчейки Цикл
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("Ячейка", ПустаяЯчейка));
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если Не ЗначениеЗаполнено(НайденнаяСтрока.Товар) И УдаляемыеСтроки.Найти(НайденнаяСтрока) = Неопределено Тогда
					УдаляемыеСтроки.Добавить(НайденнаяСтрока);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		Таблица.Удалить(УдаляемаяСтрока);	
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
